{"config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "dtype": "int32", "input_dim": 5000, "activity_regularizer": null, "output_dim": 32, "input_length": 500, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "embeddings_constraint": null, "mask_zero": false, "batch_input_shape": [null, 500]}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "implementation": 0, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "name": "lstm_1", "trainable": true, "recurrent_constraint": null, "dropout": 0.0, "bias_regularizer": null, "use_bias": true, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "return_state": false, "units": 100, "stateful": false, "unroll": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_constraint": null, "units": 1, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "bias_constraint": null}}], "class_name": "Sequential", "keras_version": "2.0.5", "backend": "tensorflow"}