{"class_name": "Sequential", "keras_version": "2.0.5", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"input_dim": 5000, "output_dim": 32, "name": "embedding_1", "embeddings_constraint": null, "batch_input_shape": [null, 500], "dtype": "int32", "trainable": true, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": 500, "activity_regularizer": null, "mask_zero": false}}, {"class_name": "LSTM", "config": {"go_backwards": false, "recurrent_dropout": 0.0, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "recurrent_constraint": null, "unroll": false, "implementation": 0, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "activation": "tanh", "stateful": false, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 100, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "return_state": false}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "kernel_constraint": null, "activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}]}